; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v1)
		(pred_6 ?v5)
		(pred_4 ?v7)
		(pred_3 ?v7)
		(pred_5 ?v5 ?v7)
		(pred_2)
		(pred_1 ?v5))

   (:action op_2
       :parameters  (?v3 ?v6)
       :precondition (and (not-eq ?v3 ?v6) 
                          (pred_4 ?v3) (pred_4 ?v6) (pred_3 ?v3))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v3))))


   (:action op_3
       :parameters (?v4 ?v2)
       :precondition  (and  (pred_6 ?v4) (pred_4 ?v2)
			    (pred_5 ?v4 ?v2) (pred_3 ?v2) (pred_2))
       :effect (and (pred_1 ?v4)
		    (not (pred_5 ?v4 ?v2)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v4  ?v2)
       :precondition  (and  (pred_6 ?v4) (pred_4 ?v2)
			    (pred_1 ?v4) (pred_3 ?v2))
       :effect (and (pred_5 ?v4 ?v2)
		    (pred_2)
		    (not (pred_1 ?v4)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_03 obj_04 obj_02 obj_05 
          obj_01 obj_07 obj_06 
)
(:init
(pred_4 obj_03)
(pred_4 obj_04)
(pred_4 obj_02)
(pred_4 obj_05)
(pred_6 obj_01)
(pred_6 obj_07)
(pred_6 obj_06)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(pred_2)
(pred_5 obj_01 obj_02)
(pred_5 obj_07 obj_03)
(pred_5 obj_06 obj_05)
(pred_3 obj_04)
)
(:goal
(and
(pred_5 obj_01 obj_02)
(pred_5 obj_07 obj_04)
(pred_5 obj_06 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_07 obj_04) (pred_3 obj_02))
    (sometime-before  (pred_5 obj_06 obj_02) (pred_3 obj_03))
  )
)
)

; plan
1. (op_2 obj_04 obj_05)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_05)
   goals met: 1 of 3
2. (op_3 obj_06 obj_05)
   deleted: (pred_5 obj_06 obj_05) (pred_2)
   added: (pred_1 obj_06)
   goals met: 1 of 3
3. (op_2 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_02)
   goals met: 1 of 3
4. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 1 of 3
5. (op_1 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_5 obj_06 obj_04) (pred_2)
   goals met: 1 of 3
6. (op_2 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_03)
   goals met: 1 of 3
7. (op_3 obj_07 obj_03)
   deleted: (pred_5 obj_07 obj_03) (pred_2)
   added: (pred_1 obj_07)
   goals met: 1 of 3
8. (op_2 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 1 of 3
9. (op_1 obj_07 obj_04)
   deleted: (pred_1 obj_07)
   added: (pred_5 obj_07 obj_04) (pred_2)
   goals met: 2 of 3
10. (op_3 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_2)
   added: (pred_1 obj_06)
   goals met: 2 of 3
11. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 2 of 3
12. (op_1 obj_06 obj_02)
   deleted: (pred_1 obj_06)
   added: (pred_5 obj_06 obj_02) (pred_2)
   goals met: 3 of 3
